function[H,U,HD,B] = baseconvert4
[sigma_x,sigma_y,sigma_z,I,Ix,Iy,Iz,ST0,ST1,Ix1,Iy1,Iz1,Ix2,Iy2,Iz2,Ix3,Iy3,Iz3,Ix4,Iy4,Iz4]=pauliform(4);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%ZLI1132的hamiltonian形式
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% w1 = 90.794; w2 = 16.371; w3 = -46.654; w4 = -60.511; 
% %w1=2335.5; w2=2456.3; w3=2495.6;          %化学位移参数
% %D12=-3215.8; D23=-669.6; D13=-2648.2;      %dipole耦合参数
% D12 = -706.56*2; D13 = -214.03*2; D14 = -1166.46*2; 
% D23 = -1553.815*2; D24 = -149.784*2; D34 = -95.46*2;
% J12=0; J13=1.4; J14=8;     %J耦合参数
% J23=8; J24=1.4; J34=8;  

w1 = 168.2851+3132.1-1469.32; w2 = 82.6477+3132.1-1469.32; w3 = 23.4745+3132.1-1469.32; w4 = 0+3132.1-1469.32;
o1 = w2;
w1 = w1-o1;w2 = w2-o1;w3=w3-o1;w4=w4-o1;


D14 = -1203.3702*2; D24 = -162.1524*2; D34 = -99.7797*2; 
D12 = -725.6956*2; D13 = -193.534*2; D23 = -1597.5939*2;
J12=0; J13=1.4; J14=8;     %J耦合参数
J23=8; J24=1.4; J34=8;

%液晶耦合的哈密顿量
H = ((w1*Iz1+w2*Iz2+w3*Iz3+w4*Iz4)+D12*(Iz1*Iz2-Ix1*Ix2/2-Iy1*Iy2/2)+D23*(Iz2*Iz3-Ix2*Ix3/2-Iy2*Iy3/2)+D13*(Iz1*Iz3-Ix1*Ix3/2-Iy1*Iy3/2)+...
      D14*(Iz1*Iz4-Ix1*Ix4/2-Iy1*Iy4/2)+D24*(Iz2*Iz4-Ix2*Ix4/2-Iy2*Iy4/2)+D34*(Iz3*Iz4-Ix3*Ix4/2-Iy3*Iy4/2)+J12*Iz1*Iz2+J23*Iz2*Iz3+J13*Iz1*Iz3+...
      J14*Iz1*Iz4+J24*Iz2*Iz4+J34*Iz3*Iz4);




%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%把H对角化，得到变换矩阵U和对角的HD,满足U'*H*U = HD
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
a1 = eig(H);
[V1,D1] = eig(H);

%对V1重新排列，得到变换矩阵U，相应的得到本征值B的重排顺序
%以下排列是从000-111的顺序,即U(:,1)-U(:,8)分别标记为三比特的000－111态




U(:,1) = V1(:,1);  B(1) = a1(1);
U(:,2) = V1(:,4);  B(2) = a1(4);
U(:,3) = V1(:,8);  B(3) = a1(8);
U(:,4) = V1(:,12);  B(4) = a1(12);
U(:,5) = V1(:,3);  B(5) = a1(3);
U(:,6) = V1(:,9);  B(6) = a1(9);
U(:,7) = V1(:,6);  B(7) = a1(6);
U(:,8) = V1(:,11);  B(8) = a1(11);
U(:,9) = V1(:,14);  B(9) = a1(14);
U(:,10) = V1(:,5);  B(10) = a1(5);
U(:,11) = V1(:,15);  B(11) = a1(15);
U(:,12) = V1(:,10);  B(12) = a1(10);
U(:,13) = V1(:,16);  B(13) = a1(16);
U(:,14) = V1(:,7);  B(14) = a1(7);
U(:,15) = V1(:,13);  B(15) = a1(13);
U(:,16) = V1(:,2);  B(16) = a1(2);

%得到的对角化的哈密顿量

HD = U'*H*U;

%H = 2*pi*H;

%save H
%save Ufunction [ output_args ] = Untitled1( input_args )
%UNTITLED1 Summary of this function goes here
%   Detailed explanation goes here
