function[H,U,HD,B] = baseconvert2
[sigma_x,sigma_y,sigma_z,I,Ix,Iy,Iz,ST0,ST1,Ix1,Iy1,Iz1,Ix2,Iy2,Iz2]=pauliform(2);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%ZLI1132的hamiltonian形式
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

w1 = 2597.8451; w2 = 2508.4940;
D = 434.2611;
J = 2.26;
 
%液晶耦合的哈密顿量

H = (w1*Iz1+w2*Iz2)+D*(Iz1*Iz2-Ix1*Ix2/2-Iy1*Iy2/2)+J*Iz1*Iz2;
  
%HD = 2375.48*Iz1+2466.97*Iz2+2444.95*Iz3+(-3947.62)*Iz1*Iz2+685.916*Iz2*Iz3+(-3254.5)*Iz1*Iz3




%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%把H对角化，得到变换矩阵U和对角的HD,满足U'*H*U = HD
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
a1 = eig(H);
[V1,D1] = eig(H);

%对V1重新排列，得到变换矩阵U，相应的得到本征值B的重排顺序
%以下排列是从00-11的顺序,即U(:,1)-U(:,4)分别标记为2比特的00－11态

U(:,1) = V1(:,4);  B(1) = a1(4);
U(:,2) = V1(:,3);  B(2) = a1(3);
U(:,3) = V1(:,2);  B(3) = a1(2);
U(:,4) = V1(:,1);  B(4) = a1(1);

%得到的对角化的哈密顿量

HD = U'*H*U;